Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Pickethall.tmx
Source language: ar
Languages: en

source: أفبعذابنا يستعجلون
en: Would they (now) hasten on Our doom?

source: أفرأيت إن متعناهم سنين
en: Hast thou then seen, if We content them for (long) years,

source: ثم جاءهم ما كانوا يوعدون
en: And then cometh that which they were promised,

source: ما أغنى عنهم ما كانوا يمتعون
en: (How) that wherewith they were contented naught availeth them?

source: وما أهلكنا من قرية إلا لها منذرون
en: And We destroyed no township but it had its warners

source: ذكرى وما كنا ظالمين
en: For reminder, for We never were oppressors.

source: وما تنزلت به الشياطين
en: The devils did not bring it down.

source: وما ينبغي لهم وما يستطيعون
en: It is not meet for them, nor is it in their power,

source: إنهم عن السمع لمعزولون
en: Lo! verily they are banished from the hearing.

source: فلا تدع مع الله إلها آخر فتكون من المعذبين
en: Therefor invoke not with Allah another god, lest thou be one of the doomed.

source: وأنذر عشيرتك الأقربين
en: And warn thy tribe of near kindred,

source: واخفض جناحك لمن اتبعك من المؤمنين
en: And lower thy wing (in kindness) unto those believers who follow thee.

source: فإن عصوك فقل إني بريء مما تعملون
en: And if they (thy kinsfolk) disobey thee, say: Lo! I am innocent of what they do.

source: وتوكل على العزيز الرحيم
en: And put thy trust in the Mighty, the Merciful.

source: الذي يراك حين تقوم
en: Who seeth thee when thou standest up (to pray)

source: وتقلبك في الساجدين
en: And (seeth) thine abasement among those who fall prostrate (in worship).

source: إنه هو السميع العليم
en: Lo! He, only He, is the Hearer, the Knower.

source: هل أنبئكم على من تنزل الشياطين
en: Shall I inform you upon whom the devils descend?

source: تنزل على كل أفاك أثيم
en: They descend on every sinful, false one.

source: يلقون السمع وأكثرهم كاذبون
en: They listen eagerly, but most of them are liars.

source: والشعراء يتبعهم الغاوون
en: As for poets, the erring follow them.

source: ألم تر أنهم في كل واد يهيمون
en: Hast thou not seen how they stray in every valley,

source: وأنهم يقولون ما لا يفعلون
en: And how they say that which they do not?

source: إلا الذين آمنوا وعملوا الصالحات وذكروا الله كثيرا وانتصروا من بعد ما ظلموا وسيعلم الذين ظلموا أي منقلب ينقلبون
en: Save those who believe and do good works, and remember Allah much, and vindicate themselves after they have been wronged. Those who do wrong will come to know by what a (great) reverse they will be overturned!

source: طس تلك آيات القرآن وكتاب مبين
en: Ta. Sin. These are revelations of the Qur'an and a Scripture that maketh plain;

source: هدى وبشرى للمؤمنين
en: A guidance and good tidings for believers

source: الذين يقيمون الصلاة ويؤتون الزكاة وهم بالآخرة هم يوقنون
en: Who establish worship and pay the poor-due and are sure of the Hereafter.

source: إن الذين لا يؤمنون بالآخرة زينا لهم أعمالهم فهم يعمهون
en: Lo! as for those who believe not in the Hereafter, We have made their works fairseeming unto them so that they are all astray.

source: أولئك الذين لهم سوء العذاب وهم في الآخرة هم الأخسرون
en: Those are they for whom is the worst of punishment, and in the Hereafter they will be the greatest losers.

source: وإنك لتلقى القرآن من لدن حكيم عليم
en: Lo! as for thee (Muhammad), thou verily receivest the Qur'an from the presence of One Wise, Aware.

source: إذ قال موسى لأهله إني آنست نارا سآتيكم منها بخبر أو آتيكم بشهاب قبس لعلكم تصطلون
en: (Remember) when Moses said unto his household: Lo! I spy afar off a fire; I will bring you tidings thence, or bring to you a borrowed flame that ye may warm yourselves.

source: فلما جاءها نودي أن بورك من في النار ومن حولها وسبحان الله رب العالمين
en: But when he reached it, he was called, saying: Blessed is Whosoever is in the fire and Whosoever is round about it! And Glorified be Allah, the Lord of the Worlds!

source: يا موسى إنه أنا الله العزيز الحكيم
en: O Moses! Lo! it is I, Allah, the Mighty, the Wise.

source: وألق عصاك فلما رآها تهتز كأنها جان ولى مدبرا ولم يعقب يا موسى لا تخف إني لا يخاف لدي المرسلون
en: And throw down thy staff! But when he saw it writhing as it were a demon, he turned to flee headlong; (but it was said unto him): O Moses! Fear not! the emissaries fear not in My presence,

source: إلا من ظلم ثم بدل حسنا بعد سوء فإني غفور رحيم
en: Save him who hath done wrong and afterward hath changed evil for good. And lo! I am Forgiving, Merciful.

source: وأدخل يدك في جيبك تخرج بيضاء من غير سوء في تسع آيات إلى فرعون وقومه إنهم كانوا قوما فاسقين
en: And put thy hand into the bosom of thy robe, it will come forth white but unhurt. (This will be one) among nine tokens unto Pharaoh and his people Lo! they were ever evil-living folk.

source: فلما جاءتهم آياتنا مبصرة قالوا هذا سحر مبين
en: But when Our tokens came unto them, plain to see, they said: This is mere magic,

source: وجحدوا بها واستيقنتها أنفسهم ظلما وعلوا فانظر كيف كان عاقبة المفسدين
en: And they denied them, though their souls acknowledged them, for spite and arrogance. Then see the nature of the consequence for the wrong-doers!

source: ولقد آتينا داوود وسليمان علما وقالا الحمد لله الذي فضلنا على كثير من عباده المؤمنين
en: And We verily gave knowledge unto David and Solomon, and they said: Praise be to Allah, Who hath preferred us above many of His believing slaves!

source: وورث سليمان داوود وقال يا أيها الناس علمنا منطق الطير وأوتينا من كل شيء إن هذا لهو الفضل المبين
en: And Solomon was David's heir. And he said: O mankind! Lo! we have been taught the language of birds, and have been given (abundance) of all things. This surely is evident favour.

source: وحشر لسليمان جنوده من الجن والإنس والطير فهم يوزعون
en: And there were gathered together unto Solomon his armies of the jinn and humankind, and of the birds, and they were set in battle order;

source: حتى إذا أتوا على واد النمل قالت نملة يا أيها النمل ادخلوا مساكنكم لا يحطمنكم سليمان وجنوده وهم لا يشعرون
en: Till, when they reached the Valley of the Ants, an ant exclaimed: O ants! Enter your dwellings lest Solomon and his armies crush you, unperceiving.

source: فتبسم ضاحكا من قولها وقال رب أوزعني أن أشكر نعمتك التي أنعمت علي وعلى والدي وأن أعمل صالحا ترضاه وأدخلني برحمتك في عبادك الصالحين
en: And (Solomon) smiled, laughing at her speech, and said: My Lord, arouse me to be thankful for Thy favour wherewith Thou hast favoured me and my parents, and to do good that shall be pleasing unto Thee, and include me in (the number of) Thy righteous slaves.

source: وتفقد الطير فقال ما لي لا أرى الهدهد أم كان من الغائبين
en: And he sought among the birds and said: How is it that I see not the hoopoe, or is he among the absent?

source: لأعذبنه عذابا شديدا أو لأذبحنه أو ليأتيني بسلطان مبين
en: I verily will punish him with hard punishment or I verily will slay him, or he verily shall bring me a plain excuse.

source: فمكث غير بعيد فقال أحطت بما لم تحط به وجئتك من سبإ بنبإ يقين
en: But he was not long in coming, and he said: I have found out (a thing) that thou apprehendest not, and I come unto thee from Sheba with sure tidings.

source: إني وجدت امرأة تملكهم وأوتيت من كل شيء ولها عرش عظيم
en: Lo! I found a woman ruling over them, and she hath been given (abundance) of all things, and hers is a mighty throne.

source: وجدتها وقومها يسجدون للشمس من دون الله وزين لهم الشيطان أعمالهم فصدهم عن السبيل فهم لا يهتدون
en: I found her and her people worshipping the sun instead of Allah; and Satan maketh their works fairseeming unto them, and debarreth them from the way (of Truth), so that they go not aright;

source: ألا يسجدوا لله الذي يخرج الخبء في السماوات والأرض ويعلم ما تخفون وما تعلنون
en: So that they worship not Allah, Who bringeth forth the hidden in the heavens and the earth, and knoweth what ye hide and what ye proclaim,

source: الله لا إله إلا هو رب العرش العظيم
en: Allah; there is no Allah save Him, the Lord of the Tremendous Throne.

source: قال سننظر أصدقت أم كنت من الكاذبين
en: (Solomon) said: We shall see whether thou speakest truth or whether thou art of the liars.

source: اذهب بكتابي هذا فألقه إليهم ثم تول عنهم فانظر ماذا يرجعون
en: Go with this my letter and throw it down unto them; then turn away and see what (answer) they return,

source: قالت يا أيها الملأ إني ألقي إلي كتاب كريم
en: (The Queen of Sheba) said (when she received the letter): O chieftains! Lo! there hath been thrown unto me a noble letter.

source: إنه من سليمان وإنه بسم الله الرحمن الرحيم
en: Lo! it is from Solomon, and lo! it is: In the name of Allah, the Beneficent, the Merciful;

source: ألا تعلوا علي وأتوني مسلمين
en: Exalt not yourselves against me, but come unto me as those who surrender.

source: قالت يا أيها الملأ أفتوني في أمري ما كنت قاطعة أمرا حتى تشهدون
en: She said: O chieftains! Pronounce for me in my case. I decide no case till ye are present with me.

source: قالوا نحن أولو قوة وأولو بأس شديد والأمر إليك فانظري ماذا تأمرين
en: They said: We are lords of might and lords of great prowess, but it is for thee to command; so consider what thou wilt command.

source: قالت إن الملوك إذا دخلوا قرية أفسدوها وجعلوا أعزة أهلها أذلة وكذلك يفعلون
en: She said: Lo! kings, when they enter a township, ruin it and make the honour of its people shame. Thus will they do.

source: وإني مرسلة إليهم بهدية فناظرة بم يرجع المرسلون
en: But lo! I am going to send a present unto them, and to see with what (answer) the messengers return.

source: فلما جاء سليمان قال أتمدونن بمال فما آتاني الله خير مما آتاكم بل أنتم بهديتكم تفرحون
en: So when (the envoy) came unto Solomon, (the King) said: What! Would ye help me with wealth? But that which Allah hath given me is better than that which He hath given you. Nay it is ye (and not I) who exult in your gift.

source: ارجع إليهم فلنأتينهم بجنود لا قبل لهم بها ولنخرجنهم منها أذلة وهم صاغرون
en: Return unto them. We verily shall come unto them with hosts that they cannot resist, and we shall drive them out from thence with shame, and they will be abased.

source: قال يا أيها الملأ أيكم يأتيني بعرشها قبل أن يأتوني مسلمين
en: He said: O chiefs! Which of you will bring me her throne before they come unto me, surrendering?

source: قال عفريت من الجن أنا آتيك به قبل أن تقوم من مقامك وإني عليه لقوي أمين
en: A stalwart of the jinn said: I will bring it thee before thou canst rise from thy place. Lo! I verily am strong and trusty for such work.

source: قال الذي عنده علم من الكتاب أنا آتيك به قبل أن يرتد إليك طرفك فلما رآه مستقرا عنده قال هذا من فضل ربي ليبلوني أأشكر أم أكفر ومن شكر فإنما يشكر لنفسه ومن كفر فإن ربي غني كريم
en: One with whom was knowledge of the Scripture said: I will bring it thee before thy gaze returneth unto thee. And when he saw it set in his presence, (Solomon) said: This is of the bounty of my Lord, that He may try me whether I give thanks or am ungrateful. Whosoever giveth thanks he only giveth thanks for (the good of) his own soul; and whosoever is ungrateful (is ungrateful only to his own soul's hurt). For lo! my Lord is Absolute in independence, Bountiful.

source: قال نكروا لها عرشها ننظر أتهتدي أم تكون من الذين لا يهتدون
en: He said: Disguise her throne for her that we may see whether she will go aright or be of those not rightly guided.

source: فلما جاءت قيل أهكذا عرشك قالت كأنه هو وأوتينا العلم من قبلها وكنا مسلمين
en: So, when she came, it was said (unto her): Is thy throne like this? She said: (It is) as though it were the very one. And (Solomon said): We were given the knowledge before her and we had surrendered (to Allah).

source: وصدها ما كانت تعبد من دون الله إنها كانت من قوم كافرين
en: And (all) that she was wont to worship instead of Allah hindered her, for she came of disbelieving folk.

source: قيل لها ادخلي الصرح فلما رأته حسبته لجة وكشفت عن ساقيها قال إنه صرح ممرد من قوارير قالت رب إني ظلمت نفسي وأسلمت مع سليمان لله رب العالمين
en: It was said unto her: Enter the hall. And when she saw it she deemed it a pool and bared her legs. (Solomon) said: Lo! it is a hall, made smooth, of glass. She said: My Lord! Lo! I have wronged myself, and I surrender with Solomon unto Allah, the Lord of the Worlds.

source: ولقد أرسلنا إلى ثمود أخاهم صالحا أن اعبدوا الله فإذا هم فريقان يختصمون
en: And We verily sent unto Thamud their brother Salih, saying: Worship Allah. And lo! they (then became two parties quarrelling.

source: قال يا قوم لم تستعجلون بالسيئة قبل الحسنة لولا تستغفرون الله لعلكم ترحمون
en: He said: O my people! Why will ye hasten on the evil rather than the good? Why will ye not ask pardon of Allah, that ye may receive mercy.

source: قالوا اطيرنا بك وبمن معك قال طائركم عند الله بل أنتم قوم تفتنون
en: They said: We augur evil of thee and those with thee. He said: Your evil augury is with Allah. Nay, but ye are folk that are being tested.

source: وكان في المدينة تسعة رهط يفسدون في الأرض ولا يصلحون
en: And there were in the city nine persons who made mischief in the land and reformed not.

source: قالوا تقاسموا بالله لنبيتنه وأهله ثم لنقولن لوليه ما شهدنا مهلك أهله وإنا لصادقون
en: They said: Swear one to another by Allah that we verily will attack him and his household by night, and afterward we will surely say unto his friend: We witnessed not the destruction of his household. And lo! we are truthtellers.

source: ومكروا مكرا ومكرنا مكرا وهم لا يشعرون
en: So they plotted a plot: and We plotted a plot, while they perceived not.

source: فانظر كيف كان عاقبة مكرهم أنا دمرناهم وقومهم أجمعين
en: Then see the nature of the consequence of their plotting, for lo! We destroyed them and their people, every one.

source: فتلك بيوتهم خاوية بما ظلموا إن في ذلك لآية لقوم يعلمون
en: See, yonder are their dwellings empty and in ruins because they did wrong. Lo! herein is indeed a portent for a people who have knowledge.

source: وأنجينا الذين آمنوا وكانوا يتقون
en: And we saved those who believed and used to ward off (evil).

source: ولوطا إذ قال لقومه أتأتون الفاحشة وأنتم تبصرون
en: And Lot! when he said unto his folk: Will ye commit abomination knowingly?

source: أئنكم لتأتون الرجال شهوة من دون النساء بل أنتم قوم تجهلون
en: Must ye needs lust after men instead of women? Nay, but ye are folk who act senselessly.

source: فما كان جواب قومه إلا أن قالوا أخرجوا آل لوط من قريتكم إنهم أناس يتطهرون
en: But the answer of his folk was naught save that they said: Expel the household of Lot from your township, for they (forsooth) are folk who would keep clean!

source: فأنجيناه وأهله إلا امرأته قدرناها من الغابرين
en: Then We saved him and his household save his wife; We destined her to be of those who stayed behind.

source: قل الحمد لله وسلام على عباده الذين اصطفى آلله خير أما يشركون
en: Say (O Muhammad): Praise be to Allah, and peace be on His slaves whom He hath chosen! Is Allah best, or (all) that ye ascribe as partners (unto Him)?

source: أمن خلق السماوات والأرض وأنزل لكم من السماء ماء فأنبتنا به حدائق ذات بهجة ما كان لكم أن تنبتوا شجرها أإله مع الله بل هم قوم يعدلون
en: Is not He (best) Who created the heavens and the earth, and sendeth down for you water from the sky wherewith We cause to spring forth joyous orchards, whose trees it never hath been yours to cause to grow. Is there any Allah beside Allah? Nay, but they are folk who ascribe equals (unto Him)!

source: أمن جعل الأرض قرارا وجعل خلالها أنهارا وجعل لها رواسي وجعل بين البحرين حاجزا أإله مع الله بل أكثرهم لا يعلمون
en: Is not He (best) Who made the earth a fixed abode, and placed rivers in the folds thereof, and placed firm hills therein, and hath set a barrier between the two seas? Is there any Allah beside Allah? Nay, but most of them know not!

source: أمن يجيب المضطر إذا دعاه ويكشف السوء ويجعلكم خلفاء الأرض أإله مع الله قليلا ما تذكرون
en: Is not He (best) Who answereth the wronged one when he crieth unto Him and removeth the evil, and hath made you viceroys of the earth? Is there any Allah beside Allah? Little do they reflect!

source: أمن يهديكم في ظلمات البر والبحر ومن يرسل الرياح بشرا بين يدي رحمته أإله مع الله تعالى الله عما يشركون
en: Is not He (best) Who guideth you in the darkness of the land and the sea, He Who sendeth the winds as heralds of His mercy? Is there any Allah beside Allah? High Exalted be Allah from all that they ascribe as partner (unto Him)!

source: أمن يبدأ الخلق ثم يعيده ومن يرزقكم من السماء والأرض أإله مع الله قل هاتوا برهانكم إن كنتم صادقين
en: Is not He (best) Who produceth creation, then reproduceth it, and Who provideth for you from the heaven and the earth? Is there any Allah beside Allah? Say: Bring your proof, if ye are truthful!

source: قل لا يعلم من في السماوات والأرض الغيب إلا الله وما يشعرون أيان يبعثون
en: Say (O Muhammad): None in the heavens and the earth knoweth the Unseen save Allah; and they know not when they will be raised (again).

source: بل ادارك علمهم في الآخرة بل هم في شك منها بل هم منها عمون
en: Nay, but doth their knowledge reach to the Hereafter? Nay, for they are in doubt concerning it. Nay, for they cannot see it.

source: وقال الذين كفروا أإذا كنا ترابا وآباؤنا أئنا لمخرجون
en: Yet those who disbelieve say: When we have become dust like our fathers, shall we verily be brought forth (again)?

source: لقد وعدنا هذا نحن وآباؤنا من قبل إن هذا إلا أساطير الأولين
en: We were promised this, forsooth, we and our fathers. (All) this is naught but fables of the men of old.

source: قل سيروا في الأرض فانظروا كيف كان عاقبة المجرمين
en: Say (unto them, O Muhammad): Travel in the land and see the nature of the sequel for the guilty!

source: ولا تحزن عليهم ولا تكن في ضيق مما يمكرون
en: And grieve thou not for them, nor be in distress because of what they plot (against thee).

source: قل عسى أن يكون ردف لكم بعض الذي تستعجلون
en: Say: It may be that a part of that which ye would hasten on is close behind you.

source: وإن ربك لذو فضل على الناس ولكن أكثرهم لا يشكرون
en: Lo! thy Lord is full of bounty for mankind, but most of them do not give thanks.

source: وإن ربك ليعلم ما تكن صدورهم وما يعلنون
en: Lo! thy Lord knoweth surely all that their bosoms hide, and all that they proclaim.

source: وما من غائبة في السماء والأرض إلا في كتاب مبين
en: And there is nothing hidden in the heaven or the earth but it is in a clear Record.

source: إن هذا القرآن يقص على بني إسرائيل أكثر الذي هم فيه يختلفون
en: Lo! this Qur'an narrateth unto the Children of Israel most of that concerning which they differ.

source: وإنه لهدى ورحمة للمؤمنين
en: And lo! it is a guidance and a mercy for believers.

source: إن ربك يقضي بينهم بحكمه وهو العزيز العليم
en: Lo! thy Lord will judge between them of His wisdom, and He is the Mighty, the Wise.

source: فتوكل على الله إنك على الحق المبين
en: Therefor (O Muhammad) put thy trust in Allah, for thou (standest) on the plain Truth.

source: إنك لا تسمع الموتى ولا تسمع الصم الدعاء إذا ولوا مدبرين
en: Lo! thou canst not make the dead to hear, nor canst thou make the deaf to hear the call when they have turned to flee;

source: وما أنت بهادي العمي عن ضلالتهم إن تسمع إلا من يؤمن بآياتنا فهم مسلمون
en: Nor canst thou lead the blind out of their error. Thou canst make none to hear, save those who believe Our revelations and who have surrendered.

source: وإذا وقع القول عليهم أخرجنا لهم دابة من الأرض تكلمهم أن الناس كانوا بآياتنا لا يوقنون
en: And when the word is fulfilled concerning them, We shall bring forth a beast of the earth to speak unto them because mankind had not faith in Our revelations.

source: ويوم نحشر من كل أمة فوجا ممن يكذب بآياتنا فهم يوزعون
en: And (remind them of) the Day when We shall gather out of every nation a host of those who denied Our revelations, and they will be set in array;

source: حتى إذا جاءوا قال أكذبتم بآياتي ولم تحيطوا بها علما أماذا كنتم تعملون
en: Till, when they come (before their Lord), He will say: Did ye deny My revelations when ye could not compass them in knowledge, or what was it that ye did?

source: ووقع القول عليهم بما ظلموا فهم لا ينطقون
en: And the Word will be fulfilled concerning them because they have done wrong, and they will not speak.

source: ألم يروا أنا جعلنا الليل ليسكنوا فيه والنهار مبصرا إن في ذلك لآيات لقوم يؤمنون
en: Have they not seen how We have appointed the night that they may rest therein, and the day sight-giving? Lo! therein verily are portents for a people who believe.

source: ويوم ينفخ في الصور ففزع من في السماوات ومن في الأرض إلا من شاء الله وكل أتوه داخرين
en: And (remind them of) the Day when the Trumpet will be blown, and all who are in the heavens and the earth will start in fear, save him whom Allah willeth. And all come unto Him, humbled.

source: وترى الجبال تحسبها جامدة وهي تمر مر السحاب صنع الله الذي أتقن كل شيء إنه خبير بما تفعلون
en: And thou seest the hills thou deemest solid flying with the flight of clouds: the doing of Allah Who perfecteth all things. Lo! He is Informed of what ye do.

source: من جاء بالحسنة فله خير منها وهم من فزع يومئذ آمنون
en: Whoso bringeth a good deed will have better than its worth; and such are safe from fear that Day.

source: ومن جاء بالسيئة فكبت وجوههم في النار هل تجزون إلا ما كنتم تعملون
en: And whoso bringeth an ill-deed, such will be flung down on their faces in the Fire. Are ye rewarded aught save what ye did?

source: إنما أمرت أن أعبد رب هذه البلدة الذي حرمها وله كل شيء وأمرت أن أكون من المسلمين
en: (Say): I (Muhammad) am commanded only to serve the Lord of this land which He hath hallowed, and unto Whom all things belong. And I am commanded to be of those who surrender (unto Him),

source: وأن أتلو القرآن فمن اهتدى فإنما يهتدي لنفسه ومن ضل فقل إنما أنا من المنذرين
en: And to recite the Qur'an. And whoso goeth right, goeth right only for (the good of) his own soul; and as for him who goeth astray - (Unto him) say: Lo! I am only a warner.

source: وقل الحمد لله سيريكم آياته فتعرفونها وما ربك بغافل عما تعملون
en: And say: Praise be to Allah Who will show you His portents so that ye shall know them. And thy Lord is not unaware of what ye (mortals) do.

source: نتلو عليك من نبإ موسى وفرعون بالحق لقوم يؤمنون
en: We narrate unto thee (somewhat) of the story of Moses and Pharaoh with truth, for folk who believe.

source: إن فرعون علا في الأرض وجعل أهلها شيعا يستضعف طائفة منهم يذبح أبناءهم ويستحيي نساءهم إنه كان من المفسدين
en: Lo! Pharaoh exalted himself in the earth and made its people castes. A tribe among them he oppressed, killing their sons and sparing their women. Lo! he was of those who work corruption.

source: ونريد أن نمن على الذين استضعفوا في الأرض ونجعلهم أئمة ونجعلهم الوارثين
en: And We desired to show favour unto those who were oppressed in the earth, and to make them examples and to make them the inheritors,

source: ونمكن لهم في الأرض ونري فرعون وهامان وجنودهما منهم ما كانوا يحذرون
en: And to establish them in the earth, and to show Pharaoh and Haman and their hosts that which they feared from them.

source: وأوحينا إلى أم موسى أن أرضعيه فإذا خفت عليه فألقيه في اليم ولا تخافي ولا تحزني إنا رادوه إليك وجاعلوه من المرسلين
en: And We inspired the mother of Moses, saying: Suckle him and, when thou fearest for him, then cast him into the river and fear not nor grieve. Lo! We shall bring him back unto thee and shall make him (one) of Our messengers.

source: فالتقطه آل فرعون ليكون لهم عدوا وحزنا إن فرعون وهامان وجنودهما كانوا خاطئين
en: And the family of Pharaoh took him up, that he might become for them an enemy and a sorrow, Lo! Pharaoh and Haman and their hosts were ever sinning.

source: وقالت امرأت فرعون قرت عين لي ولك لا تقتلوه عسى أن ينفعنا أو نتخذه ولدا وهم لا يشعرون
en: And the wife of Pharaoh said: (He will be) a consolation for me and for thee. Kill him not. Peradventure he may be of use to us, or we may choose him for a son. And they perceived not.

source: وأصبح فؤاد أم موسى فارغا إن كادت لتبدي به لولا أن ربطنا على قلبها لتكون من المؤمنين
en: And the heart of the mother of Moses became void, and she would have betrayed him if We had not fortified her heart, that she might be of the believers.
